# Final Project Phase II

## Research Question:
**Possible Ideas**\
The effect of GDP, Literacy Rate, unemployment, life expectnacy, urbanization, healthcare access percentage on mental health disorders \
Is there a corrleation between trends across different disorders?

Can we use the Human Development Index, life expectancy, population, GDP, unemployment rate, and urbanization rate from 1990-2020 to predict mental health rate in the future?

## Data Description:

Global Trends in Mental Health Disorders: https://www.kaggle.com/datasets/thedevastator/uncover-global-trends-in-mental-health-disorder

### Import Packages

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import duckdb

## Data Cleaning:
**Global Mental Health Disorders**: \
The original dataset contained NaNs and years going back to 9000 BCE for some regions. We dropped the NaN values and limited the dataset to years between 1990 and 2017. There were additional columns that only included values for very few countries, which we eliminated since it would have given us an uneven dataset.

In [3]:
##Read Datasets
#global mental health
global_mental_health_df = pd.read_csv('Mental health Depression disorder Data 2.csv')
global_mental_health_df.head()

/var/folders/7x/2j_pjlnj2v32g7jvxdd86np80000gn/T/ipykernel_30881/2536041144.py:3: DtypeWarning: Columns (5,6) have mixed types. Specify dtype option on import or set low_memory=False.
  global_mental_health_df = pd.read_csv('Mental health Depression disorder Data 2.csv')

,index,Entity,Code,Year,Schizophrenia (%),Bipolar disorder (%),Eating disorders (%),Anxiety disorders (%),Drug use disorders (%),Depression (%),Alcohol use disorders (%)
0,0,Afghanistan,AFG,1990,0.16056,0.697779,0.101855,4.828830,1.677082,4.071831,0.672404
1,1,Afghanistan,AFG,1991,0.160312,0.697961,0.099313,4.829740,1.684746,4.079531,0.671768
2,2,Afghanistan,AFG,1992,0.160135,0.698107,0.096692,4.831108,1.694334,4.088358,0.670644
3,3,Afghanistan,AFG,1993,0.160037,0.698257,0.094336,4.830864,1.705320,4.096190,0.669738
4,4,Afghanistan,AFG,1994,0.160022,0.698469,0.092439,4.829423,1.716069,4.099582,0.669260

The original dataset included columns below each other such as "Prevalence in Males" and "Prevalence in Females" that included datapoints for only a few countries so we decided to drop the rows after the last instance of the last country. Additionally, some of the values in the Year column were string instances that had to be converted to numerics.

In [13]:
#drop all rows after Prevalence in males & females
global_mental_health_df = global_mental_health_df.iloc[:6468]

#convert year to numeric and limit dataset to between years 1990-2017
global_mental_health_df['Year'] = pd.to_numeric(global_mental_health_df['Year'])
global_mental_health_df = global_mental_health_df[(global_mental_health_df['Year'] >= 1990) & (global_mental_health_df['Year'] <= 2017)]

#drop rows with NaNs
global_mental_health_df = global_mental_health_df.dropna(subset=["Schizophrenia (%)", "Bipolar disorder (%)", "Eating disorders (%)", "Anxiety disorders (%)", "Drug use disorders (%)", "Depression (%)", \
                                                                "Alcohol use disorders (%)"])

### Life Expectancy, GDP, Population Data Import and Cleaning
Link to Dataset: https://www.kaggle.com/datasets/kumarajarshi/life-expectancy-who \
The original purpose of this dataset was compiled to predict for life expectancy and included many additional variables such as additional diseases, including Hepatitis B, measels, infant deaths. Before importing the csv file, We manually altered the file by deleting the columns that included the diseases and left only the life expectancy, adult and infant mortality rates, GDP, and Population data.

In [4]:
#load in life expectancy data
life_gdp_popn_df = pd.read_csv('1Life Expectancy Data, GPD, Popn.csv')
life_gdp_popn_df.head()

,Country,Year,Status,Life expectancy,Adult Mortality,infant deaths,Alcohol,percentage expenditure,Hepatitis B,Measles,...,Polio,Total expenditure,Diphtheria,HIV/AIDS,GDP,Population,thinness 1-19 years,thinness 5-9 years,Income composition of resources,Schooling
0,Afghanistan,2015,Developing,65.0,263.0,62,0.01,71.279624,65.0,1154,...,6.0,8.16,65.0,0.1,584.259210,33736494.0,17.2,17.3,0.479,10.1
1,Afghanistan,2014,Developing,59.9,271.0,64,0.01,73.523582,62.0,492,...,58.0,8.18,62.0,0.1,612.696514,327582.0,17.5,17.5,0.476,10.0
2,Afghanistan,2013,Developing,59.9,268.0,66,0.01,73.219243,64.0,430,...,62.0,8.13,64.0,0.1,631.744976,31731688.0,17.7,17.7,0.470,9.9
3,Afghanistan,2012,Developing,59.5,272.0,69,0.01,78.184215,67.0,2787,...,67.0,8.52,67.0,0.1,669.959000,3696958.0,17.9,18.0,0.463,9.8
4,Afghanistan,2011,Developing,59.2,275.0,71,0.01,7.097109,68.0,3013,...,68.0,7.87,68.0,0.1,63.537231,2978599.0,18.2,18.2,0.454,9.5

In [24]:
# #Data Cleaning

columns_to_keep=['Country', 'Year', 'Life expectancy ', 'GDP', 'Population']

# Subset the DataFrame to include the country, year, life expectancy, population, and GDP
life_gdp_popn_subset = life_gdp_popn_df[columns_to_keep]

# Display the subset DataFrame
life_gdp_popn_subset.head()

       Country  Year  Life expectancy          GDP  Population
0  Afghanistan  2015              65.0  584.259210  33736494.0
1  Afghanistan  2014              59.9  612.696514    327582.0
2  Afghanistan  2013              59.9  631.744976  31731688.0
3  Afghanistan  2012              59.5  669.959000   3696958.0
4  Afghanistan  2011              59.2   63.537231   2978599.0

In [25]:
# Check for NaN values
nan_vals_exist = life_gdp_popn_subset.isna().any().any()

if nan_vals_exist:
    print("There are NaN values in the dataset.")
else:
    print("No NaN values in the dataset.")

rows_with_nan = life_gdp_popn_subset[life_gdp_popn_subset.isnull().any(axis=1)]

print("Rows with NaN values:")
print(rows_with_nan)

There are NaN values in the dataset.
Rows with NaN values:
                  Country  Year  Life expectancy           GDP  Population
64    Antigua and Barbuda  2015              76.4  13566.95410         NaN
65    Antigua and Barbuda  2014              76.2  12888.29667         NaN
66    Antigua and Barbuda  2013              76.1  12224.86416         NaN
67    Antigua and Barbuda  2012              75.9  12565.44197         NaN
68    Antigua and Barbuda  2011              75.7  11929.34991         NaN
...                   ...   ...               ...          ...         ...
2901                Yemen  2004              62.2          NaN         NaN
2902                Yemen  2003              61.9          NaN         NaN
2903                Yemen  2002              61.5          NaN         NaN
2904                Yemen  2001              61.1          NaN         NaN
2905                Yemen  2000              68.0          NaN         NaN

[676 rows x 5 columns]

## HDI

### Data Description:

https://hdr.undp.org/data-center/documentation-and-downloads

In [33]:
#Import HDI data
hdi_df = pd.read_csv('1HDI rates.csv')
hdi_df.head()

,iso3,country,hdicode,region,hdi_rank_2021,hdi_1990,hdi_1991,hdi_1992,hdi_1993,hdi_1994,...,hdi_2012,hdi_2013,hdi_2014,hdi_2015,hdi_2016,hdi_2017,hdi_2018,hdi_2019,hdi_2020,hdi_2021
0,AFG,Afghanistan,Low,SA,180.0,0.273,0.279,0.287,0.297,0.292,...,0.466,0.474,0.479,0.478,0.481,0.482,0.483,0.488,0.483,0.478
1,AGO,Angola,Medium,SSA,148.0,NaN,NaN,NaN,NaN,NaN,...,0.541,0.552,0.563,0.582,0.596,0.597,0.595,0.595,0.590,0.586
2,ALB,Albania,High,ECA,67.0,0.647,0.629,0.614,0.617,0.624,...,0.778,0.785,0.792,0.795,0.798,0.802,0.806,0.810,0.794,0.796
3,AND,Andorra,Very High,NaN,40.0,NaN,NaN,NaN,NaN,NaN,...,0.869,0.864,0.871,0.867,0.871,0.868,0.872,0.873,0.848,0.858
4,ARE,United Arab Emirates,Very High,AS,26.0,0.728,0.739,0.742,0.748,0.755,...,0.846,0.852,0.859,0.865,0.870,0.897,0.909,0.920,0.912,0.911

In [34]:
#renaming column names
hdi_df = hdi_df.drop('hdi_rank_2021', axis=1)
for column in hdi_df.columns:
    if column.startswith("hdi_"):
        new_column_name = column[4:]
        hdi_df.rename(columns={column: new_column_name}, inplace=True)
hdi_df.head()

,iso3,country,hdicode,region,1990,1991,1992,1993,1994,1995,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,AFG,Afghanistan,Low,SA,0.273,0.279,0.287,0.297,0.292,0.310,...,0.466,0.474,0.479,0.478,0.481,0.482,0.483,0.488,0.483,0.478
1,AGO,Angola,Medium,SSA,NaN,NaN,NaN,NaN,NaN,NaN,...,0.541,0.552,0.563,0.582,0.596,0.597,0.595,0.595,0.590,0.586
2,ALB,Albania,High,ECA,0.647,0.629,0.614,0.617,0.624,0.634,...,0.778,0.785,0.792,0.795,0.798,0.802,0.806,0.810,0.794,0.796
3,AND,Andorra,Very High,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.869,0.864,0.871,0.867,0.871,0.868,0.872,0.873,0.848,0.858
4,ARE,United Arab Emirates,Very High,AS,0.728,0.739,0.742,0.748,0.755,0.762,...,0.846,0.852,0.859,0.865,0.870,0.897,0.909,0.920,0.912,0.911

In [35]:
# List of years from 2000 to 2015
years_subset = [str(year) for year in range(2000, 2016)]

# Subset the DataFrame to include both the country name and the required columns
hdi_df_subset = hdi_df[['country'] + years_subset]

# Display the subset DataFrame
hdi_df_subset.head()

,country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Afghanistan,0.335,0.337,0.362,0.376,0.392,0.400,0.409,0.424,0.430,0.440,0.448,0.456,0.466,0.474,0.479,0.478
1,Angola,0.375,0.386,0.403,0.420,0.433,0.447,0.459,0.475,0.486,0.500,0.510,0.526,0.541,0.552,0.563,0.582
2,Albania,0.677,0.684,0.689,0.696,0.700,0.711,0.718,0.730,0.736,0.741,0.754,0.766,0.778,0.785,0.792,0.795
3,Andorra,0.818,0.825,0.832,0.841,0.833,0.833,0.848,0.847,0.850,0.848,0.848,0.849,0.869,0.864,0.871,0.867
4,United Arab Emirates,0.796,0.800,0.804,0.814,0.818,0.822,0.827,0.831,0.834,0.833,0.835,0.840,0.846,0.852,0.859,0.865

In [36]:
# Check for NaN values
nan_vals_exist = hdi_df_subset.isna().any().any()

if nan_vals_exist:
    print("There are NaN values in the dataset.")
else:
    print("No NaN values in the dataset.")

rows_with_nan = hdi_df_subset[hdi_df_subset.isnull().any(axis=1)]

print("Rows with NaN values:")
print(rows_with_nan)

There are NaN values in the dataset.
Rows with NaN values:
                                 country  2000  2001   2002   2003   2004  \
7                    Antigua and Barbuda   NaN   NaN    NaN    NaN    NaN
26                                Bhutan   NaN   NaN    NaN    NaN    NaN
52                               Eritrea   NaN   NaN  0.426  0.437  0.445
66                         Guinea-Bissau   NaN   NaN    NaN    NaN    NaN
69                               Grenada   NaN   NaN  0.739  0.747  0.742
93                 Saint Kitts and Nevis   NaN   NaN    NaN    NaN    NaN
97                               Lebanon   NaN   NaN    NaN    NaN    NaN
108                               Monaco   NaN   NaN    NaN    NaN    NaN
113                     Marshall Islands   NaN   NaN    NaN    NaN    NaN
118                           Montenegro   NaN   NaN    NaN  0.756  0.764
127                              Nigeria   NaN   NaN    NaN  0.450  0.462
132                                Nauru   NaN   NaN    NaN    NaN    NaN
142  Korea (Democratic People's Rep. of)   NaN   NaN    NaN    NaN    NaN
145                  Palestine, State of   NaN   NaN    NaN    NaN  0.651
157                           San Marino   NaN   NaN    NaN    NaN    NaN
158                              Somalia   NaN   NaN    NaN    NaN    NaN
160                          South Sudan   NaN   NaN    NaN    NaN    NaN
162                             Suriname   NaN   NaN    NaN    NaN  0.674
173                         Turkmenistan   NaN   NaN    NaN    NaN    NaN
174                          Timor-Leste   NaN   NaN  0.508  0.508  0.521
189                              Vanuatu   NaN   NaN    NaN    NaN    NaN

      2005   2006   2007   2008   2009   2010   2011   2012   2013   2014  \
7      NaN    NaN  0.802  0.801  0.795  0.790  0.783  0.787  0.787  0.789
26     NaN    NaN    NaN    NaN    NaN  0.581  0.591  0.598  0.606  0.617
52   0.449  0.453  0.457  0.448  0.457  0.463  0.481  0.486  0.483  0.502
66   0.404  0.417  0.424  0.429  0.436  0.443  0.452  0.456  0.460  0.466
69   0.763  0.765  0.773  0.778  0.777  0.782  0.786  0.784  0.787  0.787
93   0.746  0.750  0.753  0.757  0.758  0.759  0.764  0.766  0.770  0.772
97   0.737  0.734  0.752  0.760  0.767  0.770  0.771  0.762  0.759  0.750
108    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN
113    NaN    NaN    NaN    NaN    NaN    NaN  0.633  0.628  0.632  0.633
118  0.767  0.776  0.787  0.800  0.800  0.808  0.811  0.812  0.817  0.819
127  0.469  0.477  0.480  0.484  0.484  0.482  0.492  0.499  0.506  0.512
132    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN
142    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN
145  0.662  0.663  0.672  0.677  0.682  0.687  0.694  0.701  0.703  0.698
157    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN
158    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN    NaN
160    NaN    NaN    NaN    NaN    NaN  0.430  0.433  0.397  0.411  0.410
162  0.683  0.691  0.701  0.709  0.717  0.723  0.728  0.731  0.734  0.736
173  0.660  0.670  0.682  0.693  0.701  0.711  0.720  0.727  0.730  0.734
174  0.538  0.563  0.585  0.611  0.609  0.619  0.638  0.635  0.630  0.622
189  0.578  0.584  0.585  0.591  0.591  0.591  0.593  0.590  0.593  0.595

      2015
7    0.791
26   0.627
52   0.483
66   0.472
69   0.790
93   0.772
97   0.746
108    NaN
113  0.638
118  0.822
127  0.516
132    NaN
142    NaN
145  0.710
157    NaN
158    NaN
160  0.412
162  0.744
173  0.740
174  0.614
189  0.595

In [37]:
#Remove NaN values
hdi_df_clean = hdi_df_subset.dropna()
hdi_df_clean.head()

,country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Afghanistan,0.335,0.337,0.362,0.376,0.392,0.400,0.409,0.424,0.430,0.440,0.448,0.456,0.466,0.474,0.479,0.478
1,Angola,0.375,0.386,0.403,0.420,0.433,0.447,0.459,0.475,0.486,0.500,0.510,0.526,0.541,0.552,0.563,0.582
2,Albania,0.677,0.684,0.689,0.696,0.700,0.711,0.718,0.730,0.736,0.741,0.754,0.766,0.778,0.785,0.792,0.795
3,Andorra,0.818,0.825,0.832,0.841,0.833,0.833,0.848,0.847,0.850,0.848,0.848,0.849,0.869,0.864,0.871,0.867
4,United Arab Emirates,0.796,0.800,0.804,0.814,0.818,0.822,0.827,0.831,0.834,0.833,0.835,0.840,0.846,0.852,0.859,0.865

## Urbanization Rate

### Data Description:

https://www.kaggle.com/datasets/equinxx/urban-population-19602021-by-country

In [9]:
#Import Urbanization Rate data
urban_df = pd.read_csv('1urban_percent.csv')
urban_df.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,Unnamed: 65
0,Aruba,ABW,Urban population (% of total population),SP.URB.TOTL.IN.ZS,50.776000,50.761000,50.746000,50.730000,50.715000,50.700000,...,42.957000,42.990000,43.041000,43.108000,43.192000,43.293000,43.411000,43.546000,43.697000,NaN
1,Africa Eastern and Southern,AFE,Urban population (% of total population),SP.URB.TOTL.IN.ZS,14.704688,14.944459,15.185608,15.444414,15.719076,16.001992,...,33.071687,33.507548,33.952424,34.405084,34.865101,35.332373,35.807770,36.291322,36.783306,NaN
2,Afghanistan,AFG,Urban population (% of total population),SP.URB.TOTL.IN.ZS,8.401000,8.684000,8.976000,9.276000,9.586000,9.904000,...,24.160000,24.373000,24.587000,24.803000,25.020000,25.250000,25.495000,25.754000,26.026000,NaN
3,Africa Western and Central,AFW,Urban population (% of total population),SP.URB.TOTL.IN.ZS,14.670329,15.053577,15.449282,15.864021,16.294984,16.741361,...,42.901035,43.530704,44.157131,44.781373,45.401809,46.019334,46.633138,47.242853,47.848625,NaN
4,Angola,AGO,Urban population (% of total population),SP.URB.TOTL.IN.ZS,10.435000,10.798000,11.204000,11.624000,12.058000,12.504000,...,61.268000,62.002000,62.731000,63.446000,64.149000,64.839000,65.514000,66.177000,66.825000,NaN

In [16]:
# #Data Cleaning

# List of years from 2000 to 2015
years_subset = [str(year) for year in range(2000, 2016)]

# Subset the DataFrame to include both the country name and the required columns
urban_df_subset = urban_df[['Country Name'] + years_subset]

# Display the subset DataFrame
urban_df_subset.head()

,Country Name,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Aruba,46.717000,46.339000,45.972000,45.606000,45.240000,44.875000,44.511000,44.147000,43.783000,43.421000,43.059000,42.940000,42.957000,42.990000,43.041000,43.108000
1,Africa Eastern and Southern,28.669286,28.977074,29.304199,29.631273,29.961824,30.309705,30.646243,30.914094,31.331321,31.756471,32.193410,32.641548,33.071687,33.507548,33.952424,34.405084
2,Afghanistan,22.078000,22.169000,22.261000,22.353000,22.500000,22.703000,22.907000,23.113000,23.320000,23.528000,23.737000,23.948000,24.160000,24.373000,24.587000,24.803000
3,Africa Western and Central,35.352981,35.953248,36.557977,37.174436,37.799819,38.431392,39.070790,39.708825,40.345960,40.984317,41.625879,42.264663,42.901035,43.530704,44.157131,44.781373
4,Angola,50.087000,51.274000,52.461000,53.645000,54.827000,56.000000,56.764000,57.524000,58.282000,59.034000,59.783000,60.528000,61.268000,62.002000,62.731000,63.446000

In [17]:
# Check for NaN values
nan_vals_exist = urban_df_subset.isna().any().any()

if nan_vals_exist:
    print("There are NaN values in the dataset.")
else:
    print("No NaN values in the dataset.")

rows_with_nan = urban_df_subset[urban_df_subset.isnull().any(axis=1)]

print("Rows with NaN values:")
print(rows_with_nan)

There are NaN values in the dataset.
Rows with NaN values:
                 Country Name    2000    2001    2002    2003    2004    2005  \
69                    Eritrea  26.587  27.455  28.341  29.244  30.164  31.099
110            Not classified     NaN     NaN     NaN     NaN     NaN     NaN
147  St. Martin (French part)     NaN     NaN     NaN     NaN     NaN     NaN
261                    Kosovo     NaN     NaN     NaN     NaN     NaN     NaN

       2006    2007  2008    2009    2010    2011  2012  2013  2014  2015
69   32.051  33.017  34.0  34.585  35.175  35.771   NaN   NaN   NaN   NaN
110     NaN     NaN   NaN     NaN     NaN     NaN   NaN   NaN   NaN   NaN
147     NaN     NaN   NaN     NaN     NaN     NaN   NaN   NaN   NaN   NaN
261     NaN     NaN   NaN     NaN     NaN     NaN   NaN   NaN   NaN   NaN

In [18]:
#Remove NaN values
urban_df_clean = urban_df_subset.dropna()
urban_df_clean.head()

,Country Name,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Aruba,46.717000,46.339000,45.972000,45.606000,45.240000,44.875000,44.511000,44.147000,43.783000,43.421000,43.059000,42.940000,42.957000,42.990000,43.041000,43.108000
1,Africa Eastern and Southern,28.669286,28.977074,29.304199,29.631273,29.961824,30.309705,30.646243,30.914094,31.331321,31.756471,32.193410,32.641548,33.071687,33.507548,33.952424,34.405084
2,Afghanistan,22.078000,22.169000,22.261000,22.353000,22.500000,22.703000,22.907000,23.113000,23.320000,23.528000,23.737000,23.948000,24.160000,24.373000,24.587000,24.803000
3,Africa Western and Central,35.352981,35.953248,36.557977,37.174436,37.799819,38.431392,39.070790,39.708825,40.345960,40.984317,41.625879,42.264663,42.901035,43.530704,44.157131,44.781373
4,Angola,50.087000,51.274000,52.461000,53.645000,54.827000,56.000000,56.764000,57.524000,58.282000,59.034000,59.783000,60.528000,61.268000,62.002000,62.731000,63.446000

## Unemployment Rate

### Data Description:

Collected the dataset from kaggle. Took off the "country code" colunm and limited the year to 2000 to 2015. Afterwards, we checked that the dataset doesn't contain any NAN values. 

https://www.kaggle.com/datasets/pantanjali/unemployment-dataset

In [7]:
#Import Unemployment Rate data
unemploy_df = pd.read_csv('1unemployment analysis.csv')
unemploy_df.head()

#Data Cleaning

,Country Name,Country Code,1991,1992,1993,1994,1995,1996,1997,1998,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Africa Eastern and Southern,AFE,7.80,7.84,7.85,7.84,7.83,7.84,7.86,7.81,...,6.56,6.45,6.41,6.49,6.61,6.71,6.73,6.91,7.56,8.11
1,Afghanistan,AFG,10.65,10.82,10.72,10.73,11.18,10.96,10.78,10.80,...,11.34,11.19,11.14,11.13,11.16,11.18,11.15,11.22,11.71,13.28
2,Africa Western and Central,AFW,4.42,4.53,4.55,4.54,4.53,4.57,4.60,4.66,...,4.64,4.41,4.69,4.63,5.57,6.02,6.04,6.06,6.77,6.84
3,Angola,AGO,4.21,4.21,4.23,4.16,4.11,4.10,4.09,4.07,...,7.35,7.37,7.37,7.39,7.41,7.41,7.42,7.42,8.33,8.53
4,Albania,ALB,10.31,30.01,25.26,20.84,14.61,13.93,16.88,20.05,...,13.38,15.87,18.05,17.19,15.42,13.62,12.30,11.47,13.33,11.82

In [6]:
# #Data Cleaning

# List of years from 2000 to 2015
years_subset = [str(year) for year in range(2000, 2016)]

# Subset the DataFrame to include both the country name and the required columns
unemploy_df_subset = unemploy_df[['Country Name'] + years_subset]

# Display the subset DataFrame
unemploy_df_subset.head()

,Country Name,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Africa Eastern and Southern,7.72,7.73,7.96,7.79,7.31,7.12,6.99,6.74,6.27,6.32,6.87,6.75,6.56,6.45,6.41,6.49
1,Afghanistan,10.81,10.81,11.26,11.14,10.99,11.22,11.10,11.30,11.09,11.31,11.35,11.05,11.34,11.19,11.14,11.13
2,Africa Western and Central,4.92,4.87,4.78,4.75,4.73,4.73,4.65,4.63,4.60,4.58,4.55,4.55,4.64,4.41,4.69,4.63
3,Angola,4.03,4.00,3.96,3.96,3.92,3.88,3.86,3.82,3.79,3.78,9.43,7.36,7.35,7.37,7.37,7.39
4,Albania,19.03,18.58,17.90,16.99,16.31,15.97,15.63,15.97,13.06,13.67,14.09,13.48,13.38,15.87,18.05,17.19

In [7]:
# Check for NaN values
nan_vals_exist = unemploy_df_subset.isna().any().any()

if nan_vals_exist:
    print("There are NaN values in the dataset.")
else:
    print("No NaN values in the dataset.")

rows_with_nan = unemploy_df_subset[unemploy_df_subset.isnull().any(axis=1)]

print("Rows with NaN values:")
print(rows_with_nan)

No NaN values in the dataset.
Rows with NaN values:
Empty DataFrame
Columns: [Country Name, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015]
Index: []

## Exploratory Data Analysis

## Data Limitations
The global mental health disorders dataset contains categories that may overlap, since mental health disorders are not mutually exclusive. For instance, people with anxiety can also have depression.

In [ ]:
#Creates a line chart grouped by country for each disease across time
def line_plot(df, country):
    country_df = df[df['Entity'] == country]
    
    for column in df.columns[4:]:
        plt.plot(country_df['Year'], country_df[column], label=column)

    plt.xlabel('Year')
    plt.ylabel('Percent Affected')
    plt.title(f'Time Series of Mental Disorders in {country}')
    plt.legend(loc='best')
    plt.grid()
    plt.show()

In [ ]:
line_plot(global_mental_health_df, 'Albania')
line_plot(global_mental_health_df, 'France')

In [ ]:
#Create a line chart that groups by mental disorders across different countries
def line_plot(df, disorder):
    country_df = df[df.column == disorder]
    
    for column in df.columns[4:]:
        plt.plot(country_df['Year'], country_df[column], label=column)

    plt.xlabel('Year')
    plt.ylabel('Percent Affected')
    plt.title('Time Series of Mental Disorders')
    plt.legend(loc='best')  # Add a legend
    plt.grid(True)
    plt.show()

In [ ]:
line_plot(global_mental_health_df, 'Albania')